/**
 * 
 */
/**
 * @author SHUYU
 *
 */
package indi.shuyu.actionresult.entity;

/*
 * @ status
 * 0 成功
 * 1 失败
 * 
 * @code
 * // 授权相关
 * 1001: 无权限访问
 * 1002: access_token过期
 * 1003: unique_token无效
 *
 * //用户相关
 * 2001: 未登录
 * 2002: 用户信息错误
 * 2003: 用户不存在
 * 
 * //接口参数相关 
 * 3001 接口参数格式验证失败
 * 
 * // 数据库操作相关
 * // 40**规则组业务相关
 * 4000: 操作成功
 * 4001: 规则组添加失败，重复的规则组名称
 * 4002: 按规则组ID查找规则组失败
 * 4003: 更新规则组失败
 * 4004: 更新规则组失败，未知原因
 * 4007: 按规则组ID查找规则组异常，未知原因
 * 4008: 规则组删除失败，未知原因
 * 4009: 规则组添加失败，未知原因
 * 
 *  // 数据库操作相关
 * // 50**奖品务相关
 * 
 * // 规则相关
 * 60*
*/